MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6013A/mcu.h
#define _IEC1_C1IE_POSITION                      0x0000000B
#define _IEC1_C1IE_MASK                          0x00000800
#define _IEC1_C1IE_LENGTH                        0x00000001

#define _IEC1_IC3IE_POSITION                     0x0000000C
#define _IEC1_IC3IE_MASK                         0x00001000
#define _IEC1_IC3IE_LENGTH                       0x00000001

#define _IEC1_IC4IE_POSITION                     0x0000000D
#define _IEC1_IC4IE_MASK                         0x00002000
#define _IEC1_IC4IE_LENGTH                       0x00000001

#define _IEC1_IC5IE_POSITION                     0x0000000E
#define _IEC1_IC5IE_MASK                         0x00004000
#define _IEC1_IC5IE_LENGTH                       0x00000001

#define _IEC1_IC6IE_POSITION                     0x0000000F
#define _IEC1_IC6IE_MASK                         0x00008000
#define _IEC1_IC6IE_LENGTH                       0x00000001

#define _IEC2_OC5IE_POSITION                     0x00000000
#define _IEC2_OC5IE_MASK                         0x00000001
#define _IEC2_OC5IE_LENGTH                       0x00000001

#define _IEC2_OC6IE_POSITION                     0x00000001
#define _IEC2_OC6IE_MASK                         0x00000002
#define _IEC2_OC6IE_LENGTH                       0x00000001

#define _IEC2_OC7IE_POSITION                     0x00000002
#define _IEC2_OC7IE_MASK                         0x00000004
#define _IEC2_OC7IE_LENGTH                       0x00000001

#define _IEC2_OC8IE_POSITION                     0x00000003
#define _IEC2_OC8IE_MASK                         0x00000008
#define _IEC2_OC8IE_LENGTH                       0x00000001

#define _IEC2_INT3IE_POSITION                    0x00000004
#define _IEC2_INT3IE_MASK                        0x00000010
#define _IEC2_INT3IE_LENGTH                      0x00000001

#define _IEC2_INT4IE_POSITION                    0x00000005
#define _IEC2_INT4IE_MASK                        0x00000020
#define _IEC2_INT4IE_LENGTH                      0x00000001

#define _IEC2_C2IE_POSITION                      0x00000006
#define _IEC2_C2IE_MASK                          0x00000040
#define _IEC2_C2IE_LENGTH                        0x00000001

#define _IEC2_LVDIE_POSITION                     0x0000000A
#define _IEC2_LVDIE_MASK                         0x00000400
#define _IEC2_LVDIE_LENGTH                       0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

#define _IPC0_INT0IP2_POSITION                   0x00000002
#define _IPC0_INT0IP2_MASK                       0x00000004
#define _IPC0_INT0IP2_LENGTH                     0x00000001

#define _IPC0_IC1IP0_POSITION                    0x00000004
#define _IPC0_IC1IP0_MASK                        0x00000010
#define _IPC0_IC1IP0_LENGTH                      0x00000001

#define _IPC0_IC1IP1_POSITION                    0x00000005
#define _IPC0_IC1IP1_MASK                        0x00000020
#define _IPC0_IC1IP1_LENGTH                      0x00000001

#define _IPC0_IC1IP2_POSITION                    0x00000006
#define _IPC0_IC1IP2_MASK                        0x00000040
#define _IPC0_IC1IP2_LENGTH                      0x00000001

#define _IPC0_OC1IP0_POSITION                    0x00000008
#define _IPC0_OC1IP0_MASK                        0x00000100
#define _IPC0_OC1IP0_LENGTH                      0x00000001

#define _IPC0_OC1IP1_POSITION                    0x00000009
#define _IPC0_OC1IP1_MASK                        0x00000200
#define _IPC0_OC1IP1_LENGTH                      0x00000001

#define _IPC0_OC1IP2_POSITION                    0x0000000A
#define _IPC0_OC1IP2_MASK                        0x00000400
#define _IPC0_OC1IP2_LENGTH                      0x00000001

#define _IPC0_T1IP0_POSITION                     0x0000000C
#define _IPC0_T1IP0_MASK                         0x00001000
#define _IPC0_T1IP0_LENGTH                       0x00000001

#define _IPC0_T1IP1_POSITION                     0x0000000D
#define _IPC0_T1IP1_MASK                         0x00002000
#define _IPC0_T1IP1_LENGTH                       0x00000001

#define _IPC0_T1IP2_POSITION                     0x0000000E
#define _IPC0_T1IP2_MASK                         0x00004000
#define _IPC0_T1IP2_LENGTH                       0x00000001

#define _IPC1_IC2IP_POSITION                     0x00000000
#define _IPC1_IC2IP_MASK                         0x00000007
#define _IPC1_IC2IP_LENGTH                       0x00000003

#define _IPC1_OC2IP_POSITION                     0x00000004
#define _IPC1_OC2IP_MASK                         0x00000070
#define _IPC1_OC2IP_LENGTH                       0x00000003

#define _IPC1_T2IP_POSITION                      0x00000008
#define _IPC1_T2IP_MASK                          0x00000700
#define _IPC1_T2IP_LENGTH                        0x00000003

#define _IPC1_T3IP_POSITION                      0x0000000C
#define _IPC1_T3IP_MASK                          0x00007000
#define _IPC1_T3IP_LENGTH                        0x00000003

#define _IPC1_IC2IP0_POSITION                    0x00000000
#define _IPC1_IC2IP0_MASK                        0x00000001
#define _IPC1_IC2IP0_LENGTH                      0x00000001

#define _IPC1_IC2IP1_POSITION                    0x00000001
#define _IPC1_IC2IP1_MASK                        0x00000002
#define _IPC1_IC2IP1_LENGTH                      0x00000001

