MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6013A/mcu.h
#define _C1TX2B3_TX2B2D41_POSITION               0x00000001
#define _C1TX2B3_TX2B2D41_MASK                   0x00000002
#define _C1TX2B3_TX2B2D41_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D42_POSITION               0x00000002
#define _C1TX2B3_TX2B2D42_MASK                   0x00000004
#define _C1TX2B3_TX2B2D42_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D43_POSITION               0x00000003
#define _C1TX2B3_TX2B2D43_MASK                   0x00000008
#define _C1TX2B3_TX2B2D43_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D44_POSITION               0x00000004
#define _C1TX2B3_TX2B2D44_MASK                   0x00000010
#define _C1TX2B3_TX2B2D44_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D45_POSITION               0x00000005
#define _C1TX2B3_TX2B2D45_MASK                   0x00000020
#define _C1TX2B3_TX2B2D45_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D46_POSITION               0x00000006
#define _C1TX2B3_TX2B2D46_MASK                   0x00000040
#define _C1TX2B3_TX2B2D46_LENGTH                 0x00000001

#define _C1TX2B3_TX2B2D47_POSITION               0x00000007
#define _C1TX2B3_TX2B2D47_MASK                   0x00000080
#define _C1TX2B3_TX2B2D47_LENGTH                 0x00000001

#define _C1TX2B3_TXB2D50_POSITION                0x00000008
#define _C1TX2B3_TXB2D50_MASK                    0x00000100
#define _C1TX2B3_TXB2D50_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D51_POSITION                0x00000009
#define _C1TX2B3_TXB2D51_MASK                    0x00000200
#define _C1TX2B3_TXB2D51_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D52_POSITION                0x0000000A
#define _C1TX2B3_TXB2D52_MASK                    0x00000400
#define _C1TX2B3_TXB2D52_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D53_POSITION                0x0000000B
#define _C1TX2B3_TXB2D53_MASK                    0x00000800
#define _C1TX2B3_TXB2D53_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D54_POSITION                0x0000000C
#define _C1TX2B3_TXB2D54_MASK                    0x00001000
#define _C1TX2B3_TXB2D54_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D55_POSITION                0x0000000D
#define _C1TX2B3_TXB2D55_MASK                    0x00002000
#define _C1TX2B3_TXB2D55_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D56_POSITION                0x0000000E
#define _C1TX2B3_TXB2D56_MASK                    0x00004000
#define _C1TX2B3_TXB2D56_LENGTH                  0x00000001

#define _C1TX2B3_TXB2D57_POSITION                0x0000000F
#define _C1TX2B3_TXB2D57_MASK                    0x00008000
#define _C1TX2B3_TXB2D57_LENGTH                  0x00000001

#define _C1TX2B4_TX2B2D60_POSITION               0x00000000
#define _C1TX2B4_TX2B2D60_MASK                   0x00000001
#define _C1TX2B4_TX2B2D60_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D61_POSITION               0x00000001
#define _C1TX2B4_TX2B2D61_MASK                   0x00000002
#define _C1TX2B4_TX2B2D61_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D62_POSITION               0x00000002
#define _C1TX2B4_TX2B2D62_MASK                   0x00000004
#define _C1TX2B4_TX2B2D62_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D63_POSITION               0x00000003
#define _C1TX2B4_TX2B2D63_MASK                   0x00000008
#define _C1TX2B4_TX2B2D63_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D64_POSITION               0x00000004
#define _C1TX2B4_TX2B2D64_MASK                   0x00000010
#define _C1TX2B4_TX2B2D64_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D65_POSITION               0x00000005
#define _C1TX2B4_TX2B2D65_MASK                   0x00000020
#define _C1TX2B4_TX2B2D65_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D66_POSITION               0x00000006
#define _C1TX2B4_TX2B2D66_MASK                   0x00000040
#define _C1TX2B4_TX2B2D66_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D67_POSITION               0x00000007
#define _C1TX2B4_TX2B2D67_MASK                   0x00000080
#define _C1TX2B4_TX2B2D67_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D70_POSITION               0x00000008
#define _C1TX2B4_TX2B2D70_MASK                   0x00000100
#define _C1TX2B4_TX2B2D70_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D71_POSITION               0x00000009
#define _C1TX2B4_TX2B2D71_MASK                   0x00000200
#define _C1TX2B4_TX2B2D71_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D72_POSITION               0x0000000A
#define _C1TX2B4_TX2B2D72_MASK                   0x00000400
#define _C1TX2B4_TX2B2D72_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D73_POSITION               0x0000000B
#define _C1TX2B4_TX2B2D73_MASK                   0x00000800
#define _C1TX2B4_TX2B2D73_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D74_POSITION               0x0000000C
#define _C1TX2B4_TX2B2D74_MASK                   0x00001000
#define _C1TX2B4_TX2B2D74_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D75_POSITION               0x0000000D
#define _C1TX2B4_TX2B2D75_MASK                   0x00002000
#define _C1TX2B4_TX2B2D75_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D76_POSITION               0x0000000E
#define _C1TX2B4_TX2B2D76_MASK                   0x00004000
#define _C1TX2B4_TX2B2D76_LENGTH                 0x00000001

#define _C1TX2B4_TX2B2D77_POSITION               0x0000000F
#define _C1TX2B4_TX2B2D77_MASK                   0x00008000
#define _C1TX2B4_TX2B2D77_LENGTH                 0x00000001

#define _C1TX2CON_TXPRI_POSITION                 0x00000000
#define _C1TX2CON_TXPRI_MASK                     0x00000003
#define _C1TX2CON_TXPRI_LENGTH                   0x00000002

#define _C1TX2CON_TXREQ_POSITION                 0x00000003
#define _C1TX2CON_TXREQ_MASK                     0x00000008
#define _C1TX2CON_TXREQ_LENGTH                   0x00000001

#define _C1TX2CON_TXERR_POSITION                 0x00000004
#define _C1TX2CON_TXERR_MASK                     0x00000010
#define _C1TX2CON_TXERR_LENGTH                   0x00000001

#define _C1TX2CON_TXLARB_POSITION                0x00000005
#define _C1TX2CON_TXLARB_MASK                    0x00000020
#define _C1TX2CON_TXLARB_LENGTH                  0x00000001

#define _C1TX2CON_TXABT_POSITION                 0x00000006
#define _C1TX2CON_TXABT_MASK                     0x00000040
#define _C1TX2CON_TXABT_LENGTH                   0x00000001

