MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6013A/mcu.h
#define _C2TX2EID_EID9_POSITION                  0x00000003
#define _C2TX2EID_EID9_MASK                      0x00000008
#define _C2TX2EID_EID9_LENGTH                    0x00000001

#define _C2TX2EID_EID10_POSITION                 0x00000004
#define _C2TX2EID_EID10_MASK                     0x00000010
#define _C2TX2EID_EID10_LENGTH                   0x00000001

#define _C2TX2EID_EID11_POSITION                 0x00000005
#define _C2TX2EID_EID11_MASK                     0x00000020
#define _C2TX2EID_EID11_LENGTH                   0x00000001

#define _C2TX2EID_EID12_POSITION                 0x00000006
#define _C2TX2EID_EID12_MASK                     0x00000040
#define _C2TX2EID_EID12_LENGTH                   0x00000001

#define _C2TX2EID_EID13_POSITION                 0x00000007
#define _C2TX2EID_EID13_MASK                     0x00000080
#define _C2TX2EID_EID13_LENGTH                   0x00000001

#define _C2TX2EID_EID14_POSITION                 0x0000000C
#define _C2TX2EID_EID14_MASK                     0x00001000
#define _C2TX2EID_EID14_LENGTH                   0x00000001

#define _C2TX2EID_EID15_POSITION                 0x0000000D
#define _C2TX2EID_EID15_MASK                     0x00002000
#define _C2TX2EID_EID15_LENGTH                   0x00000001

#define _C2TX2EID_EID16_POSITION                 0x0000000E
#define _C2TX2EID_EID16_MASK                     0x00004000
#define _C2TX2EID_EID16_LENGTH                   0x00000001

#define _C2TX2EID_EID17_POSITION                 0x0000000F
#define _C2TX2EID_EID17_MASK                     0x00008000
#define _C2TX2EID_EID17_LENGTH                   0x00000001

#define _C2TX2EID_EID13_6_POSITION               0x00000000
#define _C2TX2EID_EID13_6_MASK                   0x000000FF
#define _C2TX2EID_EID13_6_LENGTH                 0x00000008

#define _C2TX2EID_EID17_14_POSITION              0x0000000C
#define _C2TX2EID_EID17_14_MASK                  0x0000F000
#define _C2TX2EID_EID17_14_LENGTH                0x00000004

#define _C2TX2DLC_DLC_POSITION                   0x00000003
#define _C2TX2DLC_DLC_MASK                       0x00000078
#define _C2TX2DLC_DLC_LENGTH                     0x00000004

#define _C2TX2DLC_TXRB0_POSITION                 0x00000007
#define _C2TX2DLC_TXRB0_MASK                     0x00000080
#define _C2TX2DLC_TXRB0_LENGTH                   0x00000001

#define _C2TX2DLC_TXRB1_POSITION                 0x00000008
#define _C2TX2DLC_TXRB1_MASK                     0x00000100
#define _C2TX2DLC_TXRB1_LENGTH                   0x00000001

#define _C2TX2DLC_TXRTR_POSITION                 0x00000009
#define _C2TX2DLC_TXRTR_MASK                     0x00000200
#define _C2TX2DLC_TXRTR_LENGTH                   0x00000001

#define _C2TX2DLC_EID0_POSITION                  0x0000000A
#define _C2TX2DLC_EID0_MASK                      0x00000400
#define _C2TX2DLC_EID0_LENGTH                    0x00000001

#define _C2TX2DLC_EID1_POSITION                  0x0000000B
#define _C2TX2DLC_EID1_MASK                      0x00000800
#define _C2TX2DLC_EID1_LENGTH                    0x00000001

#define _C2TX2DLC_EID2_POSITION                  0x0000000C
#define _C2TX2DLC_EID2_MASK                      0x00001000
#define _C2TX2DLC_EID2_LENGTH                    0x00000001

#define _C2TX2DLC_EID3_POSITION                  0x0000000D
#define _C2TX2DLC_EID3_MASK                      0x00002000
#define _C2TX2DLC_EID3_LENGTH                    0x00000001

#define _C2TX2DLC_EID4_POSITION                  0x0000000E
#define _C2TX2DLC_EID4_MASK                      0x00004000
#define _C2TX2DLC_EID4_LENGTH                    0x00000001

#define _C2TX2DLC_EID5_POSITION                  0x0000000F
#define _C2TX2DLC_EID5_MASK                      0x00008000
#define _C2TX2DLC_EID5_LENGTH                    0x00000001

#define _C2TX2DLC_EID5_0_POSITION                0x0000000A
#define _C2TX2DLC_EID5_0_MASK                    0x0000FC00
#define _C2TX2DLC_EID5_0_LENGTH                  0x00000006

#define _C2TX2DLC_DLC0_POSITION                  0x00000003
#define _C2TX2DLC_DLC0_MASK                      0x00000008
#define _C2TX2DLC_DLC0_LENGTH                    0x00000001

#define _C2TX2DLC_DLC1_POSITION                  0x00000004
#define _C2TX2DLC_DLC1_MASK                      0x00000010
#define _C2TX2DLC_DLC1_LENGTH                    0x00000001

#define _C2TX2DLC_DLC2_POSITION                  0x00000005
#define _C2TX2DLC_DLC2_MASK                      0x00000020
#define _C2TX2DLC_DLC2_LENGTH                    0x00000001

#define _C2TX2DLC_DLC3_POSITION                  0x00000006
#define _C2TX2DLC_DLC3_MASK                      0x00000040
#define _C2TX2DLC_DLC3_LENGTH                    0x00000001

#define _C2TX2B1_TXB2D00_POSITION                0x00000000
#define _C2TX2B1_TXB2D00_MASK                    0x00000001
#define _C2TX2B1_TXB2D00_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D01_POSITION                0x00000001
#define _C2TX2B1_TXB2D01_MASK                    0x00000002
#define _C2TX2B1_TXB2D01_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D02_POSITION                0x00000002
#define _C2TX2B1_TXB2D02_MASK                    0x00000004
#define _C2TX2B1_TXB2D02_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D03_POSITION                0x00000003
#define _C2TX2B1_TXB2D03_MASK                    0x00000008
#define _C2TX2B1_TXB2D03_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D04_POSITION                0x00000004
#define _C2TX2B1_TXB2D04_MASK                    0x00000010
#define _C2TX2B1_TXB2D04_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D05_POSITION                0x00000005
#define _C2TX2B1_TXB2D05_MASK                    0x00000020
#define _C2TX2B1_TXB2D05_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D06_POSITION                0x00000006
#define _C2TX2B1_TXB2D06_MASK                    0x00000040
#define _C2TX2B1_TXB2D06_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D07_POSITION                0x00000007
#define _C2TX2B1_TXB2D07_MASK                    0x00000080
#define _C2TX2B1_TXB2D07_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D10_POSITION                0x00000008
#define _C2TX2B1_TXB2D10_MASK                    0x00000100
#define _C2TX2B1_TXB2D10_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D11_POSITION                0x00000009
#define _C2TX2B1_TXB2D11_MASK                    0x00000200
#define _C2TX2B1_TXB2D11_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D12_POSITION                0x0000000A
#define _C2TX2B1_TXB2D12_MASK                    0x00000400
#define _C2TX2B1_TXB2D12_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D13_POSITION                0x0000000B
#define _C2TX2B1_TXB2D13_MASK                    0x00000800
#define _C2TX2B1_TXB2D13_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D14_POSITION                0x0000000C
#define _C2TX2B1_TXB2D14_MASK                    0x00001000
#define _C2TX2B1_TXB2D14_LENGTH                  0x00000001

