MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6013A/mcu.h
#define _C2INTE_TX2IE_POSITION                   0x00000004
#define _C2INTE_TX2IE_MASK                       0x00000010
#define _C2INTE_TX2IE_LENGTH                     0x00000001

#define _C2INTE_IVRIE_POSITION                   0x00000007
#define _C2INTE_IVRIE_MASK                       0x00000080
#define _C2INTE_IVRIE_LENGTH                     0x00000001

#define _C2EC_REC0_POSITION                      0x00000000
#define _C2EC_REC0_MASK                          0x00000001
#define _C2EC_REC0_LENGTH                        0x00000001

#define _C2EC_REC1_POSITION                      0x00000001
#define _C2EC_REC1_MASK                          0x00000002
#define _C2EC_REC1_LENGTH                        0x00000001

#define _C2EC_REC2_POSITION                      0x00000002
#define _C2EC_REC2_MASK                          0x00000004
#define _C2EC_REC2_LENGTH                        0x00000001

#define _C2EC_REC3_POSITION                      0x00000003
#define _C2EC_REC3_MASK                          0x00000008
#define _C2EC_REC3_LENGTH                        0x00000001

#define _C2EC_REC4_POSITION                      0x00000004
#define _C2EC_REC4_MASK                          0x00000010
#define _C2EC_REC4_LENGTH                        0x00000001

#define _C2EC_REC5_POSITION                      0x00000005
#define _C2EC_REC5_MASK                          0x00000020
#define _C2EC_REC5_LENGTH                        0x00000001

#define _C2EC_REC6_POSITION                      0x00000006
#define _C2EC_REC6_MASK                          0x00000040
#define _C2EC_REC6_LENGTH                        0x00000001

#define _C2EC_REC7_POSITION                      0x00000007
#define _C2EC_REC7_MASK                          0x00000080
#define _C2EC_REC7_LENGTH                        0x00000001

#define _C2EC_TEC0_POSITION                      0x00000008
#define _C2EC_TEC0_MASK                          0x00000100
#define _C2EC_TEC0_LENGTH                        0x00000001

#define _C2EC_TEC1_POSITION                      0x00000009
#define _C2EC_TEC1_MASK                          0x00000200
#define _C2EC_TEC1_LENGTH                        0x00000001

#define _C2EC_TEC2_POSITION                      0x0000000A
#define _C2EC_TEC2_MASK                          0x00000400
#define _C2EC_TEC2_LENGTH                        0x00000001

#define _C2EC_TEC3_POSITION                      0x0000000B
#define _C2EC_TEC3_MASK                          0x00000800
#define _C2EC_TEC3_LENGTH                        0x00000001

#define _C2EC_TEC4_POSITION                      0x0000000C
#define _C2EC_TEC4_MASK                          0x00001000
#define _C2EC_TEC4_LENGTH                        0x00000001

#define _C2EC_TEC5_POSITION                      0x0000000D
#define _C2EC_TEC5_MASK                          0x00002000
#define _C2EC_TEC5_LENGTH                        0x00000001

#define _C2EC_TEC6_POSITION                      0x0000000E
#define _C2EC_TEC6_MASK                          0x00004000
#define _C2EC_TEC6_LENGTH                        0x00000001

#define _C2EC_TEC7_POSITION                      0x0000000F
#define _C2EC_TEC7_MASK                          0x00008000
#define _C2EC_TEC7_LENGTH                        0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_LVDL_POSITION                      0x00000008
#define _RCON_LVDL_MASK                          0x00000F00
#define _RCON_LVDL_LENGTH                        0x00000004

#define _RCON_LVDEN_POSITION                     0x0000000C
#define _RCON_LVDEN_MASK                         0x00001000
#define _RCON_LVDEN_LENGTH                       0x00000001

#define _RCON_BGST_POSITION                      0x0000000D
#define _RCON_BGST_MASK                          0x00002000
#define _RCON_BGST_LENGTH                        0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _RCON_LVDL0_POSITION                     0x00000008
#define _RCON_LVDL0_MASK                         0x00000100
#define _RCON_LVDL0_LENGTH                       0x00000001

#define _RCON_LVDL1_POSITION                     0x00000009
#define _RCON_LVDL1_MASK                         0x00000200
#define _RCON_LVDL1_LENGTH                       0x00000001

#define _RCON_LVDL2_POSITION                     0x0000000A
#define _RCON_LVDL2_MASK                         0x00000400
#define _RCON_LVDL2_LENGTH                       0x00000001

#define _RCON_LVDL3_POSITION                     0x0000000B
#define _RCON_LVDL3_MASK                         0x00000800
#define _RCON_LVDL3_LENGTH                       0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_LPOSCEN_POSITION                 0x00000001
#define _OSCCON_LPOSCEN_MASK                     0x00000002
#define _OSCCON_LPOSCEN_LENGTH                   0x00000001

