MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6013A/mcu.h
#define WDT_OFF              0x003F
#define WDT_ON               0x803F

/* Register FBORPOR (0xf80004)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBORPOR;
#define _FBORPOR(x) __attribute__((address(0xf80004),deprecated_definition("consider migrating to #pragma config"),section("__FBORPOR.sec"),space(prog))) __prog__ uint16_t _FBORPOR = (x);

/*
** Only one invocation of FBORPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBORPOR.
** Multiple options may be combined, as shown:
**
** _FBORPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   POR Timer Value:
**     PWRT_OFF             Timer Disabled
**     PWRT_4               4ms
**     PWRT_16              16ms
**     PWRT_64              64ms
**
**   Brown Out Voltage:
**     BORV_45              4.5V
**     BORV_42              4.2V
**     BORV_27              2.7V
**     NONE                 Reserved
**
**   PBOR Enable:
**     PBOR_OFF             Disabled
**     PBOR_ON              Enabled
**
**   Master Clear Enable:
**     MCLR_DIS             Disabled
**     MCLR_EN              Enabled
**
*/

#define PWRT_OFF             0x87B0
#define PWRT_4               0x87B1
#define PWRT_16              0x87B2
#define PWRT_64              0x87B3

#define BORV_45              0x8783
#define BORV_42              0x8793
#define BORV_27              0x87A3
#define NONE                 0x87B3

#define PBOR_OFF             0x8733
#define PBOR_ON              0x87B3

#define MCLR_DIS             0x07B3
#define MCLR_EN              0x87B3

/* Register FBS (0xf80006)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBS;
#define _FBS(x) __attribute__((address(0xf80006),deprecated_definition("consider migrating to #pragma config"),section("__FBS.sec"),space(prog))) __prog__ uint16_t _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Program Memory Write Protect:
**     WR_PROTECT_BOOT_ON   Boot Segment Program Memory is write protected
**     WR_PROTECT_BOOT_OFF  Boot Segment Program Memory may be written
**
**   Boot Segment Program Flash Memory Code Protection:
**     HIGH_LARGE_BOOT_CODE High Security, Large-sized Boot Flash
**     HIGH_MEDIUM_BOOT_CODEHigh Security, Medium-sized Boot Flash
**     HIGH_SMALL_BOOT_CODE High Security, Small-sized Boot Flash
**     STRD_LARGE_BOOT_CODE Standard Security, Large-sized Boot Flash
**     STRD_MEDIUM_BOOT_CODEStandard Security, Medium-sized Boot Flash
**     STRD_SMALL_BOOT_CODE Standard Security, Small-sized Boot Flash
**     NO_BOOT_CODE         No Boot Segment
**
**   Boot Segment Data EEPROM Protection:
**     SMALL_BOOT_EEPROM    Boot EEPROM Enabled
**     NO_BOOT_EEPROM       No Boot EEPROM
**
**   Boot Segment Data RAM Protection:
**     LARGE_BOOT_RAM       Large-sized Boot RAM
**     MED_BOOT_RAM         Medium-sized Boot RAM
**     SMALL_BOOT_RAM       Small-sized Boot RAM
**     NO_BOOT_RAM          No Boot RAM
**
*/

#define WR_PROTECT_BOOT_ON   0x310E
#define WR_PROTECT_BOOT_OFF  0x310F

#define HIGH_LARGE_BOOT_CODE 0x3101
#define HIGH_MEDIUM_BOOT_CODE 0x3103
#define HIGH_SMALL_BOOT_CODE 0x3105
#define STRD_LARGE_BOOT_CODE 0x3109
#define STRD_MEDIUM_BOOT_CODE 0x310B
#define STRD_SMALL_BOOT_CODE 0x310D
#define NO_BOOT_CODE         0x310F

#define SMALL_BOOT_EEPROM    0x300F
#define NO_BOOT_EEPROM       0x310F

#define LARGE_BOOT_RAM       0x010F
#define MED_BOOT_RAM         0x110F
#define SMALL_BOOT_RAM       0x210F
#define NO_BOOT_RAM          0x310F

/* Register FSS (0xf80008)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSS;
#define _FSS(x) __attribute__((address(0xf80008),deprecated_definition("consider migrating to #pragma config"),section("__FSS.sec"),space(prog))) __prog__ uint16_t _FSS = (x);

/*
** Only one invocation of FSS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSS.
** Multiple options may be combined, as shown:
**
** _FSS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Secure Segment Program Write Protect:
**     WR_PROT_SEC_ON       Enabled
**     WR_PROT_SEC_OFF      Disabled
**
**   Secure Segment Program Flash Memory Code Protection:
**     HIGH_LARGE_SEC_CODE  High Security, Large-sized Secure Flash
**     HIGH_MEDIUM_SEC_CODE High Security, Medium-sized Secure Flash
**     HIGH_SMALL_SEC_CODE  High Security, Small-sized Secure Flash
**     STRD_LAR_SEC_CODE    Standard Security, Large-sized Secure Flash
**     STRD_MED_SEC_CODE    Standard Security, Medium-sized Secure Flash
**     STRD_SMALL_SEC_CODE  Standard Security, Small-sized Secure Flash
**     NO_SEC_CODE          No Secure Segment
**
**   Secure Segment Data EEPROM Protection:
**     LAR_SEC_EEPROM       Large-sized Secure Data EEPROM
**     MED_SEC_EEPROM       Medium-sized Secure Data EEPROM
**     SMALL_SEC_EEPROM     Small-sized Secure Data EEPROM
**     NO_SEC_EEPROM        No Segment Data EEPROM
**
**   Secure Segment Data RAM Protection:
**     LARGE_SEC_RAM        Large-sized Secure RAM
**     MED_SEC_RAM          Medium-sized Secure RAM
**     SMALL_SEC_RAM        Small-sized Secure RAM
**     NO_SEC_RAM           No Secure RAM
**
*/

#define WR_PROT_SEC_ON       0x330E
#define WR_PROT_SEC_OFF      0x330F

#define HIGH_LARGE_SEC_CODE  0x3301
#define HIGH_MEDIUM_SEC_CODE 0x3303
#define HIGH_SMALL_SEC_CODE  0x3305
#define STRD_LAR_SEC_CODE    0x3309
#define STRD_MED_SEC_CODE    0x330B
#define STRD_SMALL_SEC_CODE  0x330D
#define NO_SEC_CODE          0x330F

#define LAR_SEC_EEPROM       0x300F
#define MED_SEC_EEPROM       0x310F
#define SMALL_SEC_EEPROM     0x320F
#define NO_SEC_EEPROM        0x330F

#define LARGE_SEC_RAM        0x030F
#define MED_SEC_RAM          0x130F
#define SMALL_SEC_RAM        0x230F
#define NO_SEC_RAM           0x330F

/* Register FGS (0xf8000a)                               */

